<?php

/*

// 入力される値
// N M

期待する出力
N が何回 M で割れるかを求め、出力してください。

*/

$str_04 = fgets(STDIN);
//print($str_04);

$arr_04 = explode(" ", $str_04);
//print_r($arr_04);

$ans_04 = 0;
while ($arr_04[0] % $arr_04[1] == 0) {
    $arr_04[0] = $arr_04[0] / $arr_04[1];
    $ans_04 += 1;
}

print($ans_04);

// ============================================================ END

/*

10 進数で表された整数 N が与えられます。
N を 2 進数に変換して出力してください。

decbin

入力例1
4
出力例1
100

*/

$num_06 = fgets(STDIN);
$ans_06 = decbin($num_06);

print($ans_06);

// ============================================================ END

/*

期待する出力
N を M 進数に変換して出力してください。

入力例1
10 2

出力例1
1010

*/

$str_07 = fgets(STDIN);
$arr_07 = explode(" ", $str_07);

for ($i = 1; $i <= 16; $i++) {

    if ($arr_07[1] == $i) {
        $ans_07 = base_convert($arr_07[0], 10, $i);
        print($ans_07);
        break;
    }
}

// ============================================================ END

/*

入力例1
1 1 10

出力例1
10

整数 N, M, K が与えられます。
N が M ずつ増えるとき、何回目に K を越えるか出力してください。

*/

$str_08 = fgets(STDIN);
$arr_08 = explode(" ", $str_08);

$i = 0;
$ans_08 = 0;
while ($arr_08[2] >= $arr_08[0]) {
    $arr_08[0] = $arr_08[1] + $arr_08[0];
    $ans_08 += 1;
}

print($ans_08);

// ============================================================ END


/*

期待する出力
所持金が毎日 10% ずつ増えるとき、何日後に B 円を超えるか出力してください。

入力例1
10 15

出力例1
6

*/

$str_09 = fgets(STDIN);
$arr_09 = explode(" ", $str_09);

$ans_09 = 1;
while ($arr_09[1] > $arr_09[0]) {
    // 10% を加算
    $tmp_09 = floor($arr_09[0] / 10);
    $arr_09[0] += $tmp_09;
    $ans_09 = $ans_09 + 1;
}

print($ans_09);


// ============================================================ END