<?php

// ======================================= 01
/*

入力例2
5

出力例2
1 2 3 4 5

*/

fscanf(STDIN, "%d", $n);

for ($i = 1; $i <= $n; $i++) {
    if ($i == $n) {
        print($i);
    } else {
        print($i . " ");
    }
}

// ====================================== END

// ======================================= 02
/*

入力例2
7

出力例2
1
2
3
4
5
6
7

*/

fscanf(STDIN, "%d", $n);

function D_loop_02($str)
{

    for ($i = 1; $i <= $str; $i++) {
        if ($i == $str) {
            print($i);
        } else {
            print($i . "\n");
        }
    }
}

D_loop_02($n);


// ====================================== END

// ======================================= 03
/*

入力例1
5

出力例1
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5
1 2 3 4 5

*/

fscanf(STDIN, "%d", $n);

function D_loop_03($num)
{

    for ($i = 0; $i < $num; $i++) {
        for ($j = 1; $j <= 5; $j++) {
            if ($j == 5) {
                print($j . "\n");
            } else {
                print($j . " ");
            }
        }
    }
}

D_loop_03($n);

// ====================================== END

// ======================================= 04

fscanf(STDIN, "%d %d", $n, $m);

function D_loop_04($num, $num2)
{
    for ($i = 1; $i <= $num; $i++) {

        for ($j = 1; $j <= $num2; $j++) {
            if ($num2 == $j) {
                print($j . "\n");
            } else {
                print($j . " ");
            }
        }
    }
}

D_loop_04($m, $n);
// ====================================== END

// ======================================= 05

/*

入力例1
3 4
92 15 49 19
20 89 92 47
0 87 42 45

出力例1
92 15 49 19
20 89 92 47
0 87 42 45

*/

fscanf(STDIN, "%d %d", $n, $k);

// === ２次元配列へ値を格納
$arr = [];
for ($i = 0; $i < $n; $i++) {

    //　１行受けとる
    $tmp = trim(fgets(STDIN));
    //　分割して配列へ格納
    $arr[$i] = explode(" ", $tmp);

    //　出力　部分　
    for ($j = 0; $j < $k; $j++) {

        // 末尾だったら、改行コードを入れて改行
        if ($j == $k - 1) {
            print($arr[$i][$j] . "\n");
        } else {
            // 末尾じゃなかったら、、スペースを入れて出力
            print($arr[$i][$j] . " ");
        }
    }
}

// ====================================== END