<?php

// ============================================================
//=========================== 線形探査 =========================
// ============================================================


/*

整数 n と、数列 a_1, ... , a_n と、整数 k が与えられます。

a_1, ... , a_n のうち k は何個あるかを求めてください。

-------------------

n
a_1 a_2 ... a_n
k

------------------

入力例1
5
-3 2 0 -1 2
2

出力例1
2

*/

$num = fgets(STDIN);
$str = fgets(STDIN);
$hikaku = fgets(STDIN);

$arr_tmp = explode(" ", $str);

$result = 0;
for ($i = 0; $i < $num; $i++) {
    // === $hikaku と一致していたら、$resultをカウントアップ
    if ($arr_tmp[$i] == $hikaku) {
        $result = $result + 1;
    }
}

// === 出力
print($result);

// ========================================================= END
